app/views/reservations/_form.html.erb

SELECT "users".* FROM "users"
---
    	<%= f.label :user %><br>
    	<%= f.select :email, options_for_select(User.all.map{|s|[s.email]}) %>

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."room_name" = ? LIMIT 1  [["room_name", "hill123"]]
---
    <%= f.label :room_name %><br>
    <%= f.select :room_name, options_for_select(Room.all.map{|s|[s.room_name]}) %>